Ran Plan for 3 projects:

1. project: `gateway-cloudfront-prod` dir: `terraform/environments/prod/cloudfront` workspace: `default`
1. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
1. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
---

### 1. project: `gateway-cloudfront-prod` dir: `terraform/environments/prod/cloudfront` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-cloudfront-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fprod%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-cloudfront-prod
  ```

---
### 2. project: `gateway-ecs-gateway-stage` dir: `terraform/environments/stage/ecs-gateway` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_listener.https will be updated in-place
~ resource "aws_lb_listener" "https" {
      ~ certificate_arn                                                       = (sensitive value)
        id                                                                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/gateway-alb-stage/e61b64a4244c17a0/08c8169373251cc0"
        tags                                                                  = {}
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/gateway-cluster-stage/gateway-stage"
        name                               = "gateway-stage"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS service for gateway-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "gateway-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "gateway"
            "Service"     = "gateway"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:19" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "gateway-stage" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "internal"
            "Description" = "ECS task definition for gateway-stage"
            "Environment" = "stage"
            "Lifecycle"   = "temporary"
            "ManagedBy"   = "terraform"
            "Name"        = "gateway-stage"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "gateway"
            "Service"     = "gateway"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/gateway-stage:15" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-ecs-gateway-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fecs-gateway%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-ecs-gateway-stage
  ```
Plan: 1 to add, 2 to change, 1 to destroy.

---
### 3. project: `gateway-cloudfront-stage` dir: `terraform/environments/stage/cloudfront` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.stage will be updated in-place
~ resource "aws_route53_record" "stage" {
        id                               = "Z104656329CL6XBYE8OIJ_stage.set-of.com_A"
        name                             = "stage.set-of.com"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ evaluate_target_health = true -> false
          ~ name                   = "setof-commerce-leg-alb-stg-1355489929.ap-northeast-2.elb.amazonaws.com" -> "d26ruqzuekegl4.cloudfront.net"
          ~ zone_id                = "ZWKZPGTI48KDX" -> "Z2FDTNDATAQYW2"
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p gateway-cloudfront-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FGateway%252Fterraform%252Fenvironments%252Fstage%252Fcloudfront%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p gateway-cloudfront-stage
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
### Plan Summary

3 projects, 2 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```